var
    // величины, формулы их расчёта и описания
	inputs = [
        ['D', 'Номинальный размер', 'Dmax', 'ES', '-'],
        ['Dmax', 'Наибольший предельный размер отверстия', 'ES', 'D', '+'],
        ['Dmin', 'Наименьший предельный размер отверстия', '', '', ''],
        ['Dm', 'Средний размер отверстия', '', '', ''],
        ['dmax', 'Наибольший предельный размер вала', '', '', ''],
        ['dmin', 'Наименьший предельный размер вала', '', '', ''],
        ['dm', 'Средний размер вала', '', '', ''],
        ['ES', 'Верхнее отклонение отверстия', 'Dmax', 'D', '-'],
        ['EI', 'Нижнее отклонение отверстия', 'Dmin', 'D', '-'],
        ['Em', 'Среднее отклонение отверстия', '', '', ''],
        ['es', 'Верхнее отклонение вала', 'dmax', 'd', '-'],
        ['ei', 'Нижнее отклонение вала', 'dmin', 'd', '-'],
        ['em', 'Среднее отклонение вала', '', '', ''],
        ['Smax', 'Наибольший гарантированный зазор', 'Dmax', 'dmin', '-'],
        //['Smax', '', 'ES', 'ei', ''],
        ['Smin', 'Наименьший гарантированный зазор', 'Dmin', 'dmax', '-'],
        //['Smin', '', 'EI', 'es', '-'],
        ['Sm', 'Средний (наиболее вероятный) зазор', 'Dm', 'dm', '-'],
        //['Sm', '', 'Em', 'em', '-'],
        ['Nmax', 'Наибольший гарантированный натяг', 'dmax', 'Dmin', '-'],
        //['Nmax', '', 'es', 'EI', '-'],
        ['Nmin', 'Наименьший гарантированный натяг', 'dmin', 'Dmax', '-'],
        //['Nmin', '', 'ei', 'ES', '-'],
        ['Nm', 'Средний (наиболее вероятный) натяг', 'dm', 'DM', '-'],
        //['Nm', '', 'em', 'Em', '-'],
        ['TD', 'Допуск отверстия', 'Dmax', 'Dmin', '-'],
        ['Td', 'Допуск вала', 'dmax', 'dmin', '-'],
        ['Ts', 'Допуск зазора (посадки)', 'Smax', 'Smin', '-'],
        //['Ts', '', 'TD', 'Td', '-'],
        ['TN', 'Допуск натяга (посадки)', 'Nmax', 'Nmin', '-'],
        //['TN', '', 'TD', 'Td', '-'],
        ['', '', '', '', ''],
        ['', '', '', '', ''],
        ['', '', '', '', ''],
        ['', '', '', '', ''],
        ['', '', '', '', ''],
        ['', '', '', '', ''],
        ['', '', '', '', '']
    ];


$(document).ready(function(){
    // генерация полей
    for (var i = 0; i < inputs.length; ++i){
        if (!(inputs[i][0])) continue; // TEMP
        $('table').append( $('<tr><td>' + inputs[i][0] + '</td><td><input value="" class="' + inputs[i][0] + '"></td><td>' + inputs[i][1] + '</td></tr>') );
    }

	function calculate(operand, operand2, operation){
         /*
         ПОДСЧЁТ ЗНАЧЕНИЙ В ПОЛЯХ
         Принимает:
            (string) класс первого поля
            (string) класс второго поля
            (string) операция
         Возвращает:
            (int) результат
         */
        if (!(operand && operand2)) return '';
        operand = $('.' + operand).val();
        operand2 = $('.' + operand2).val();
        if (operand && operand2){  // если имеются данные для совершения операции
            return eval('parseInt(' + operand + ')' + operation + 'parseInt(' + operand2 + ')');
        }
        else return ''
	}

    // клик по кнопке подсчёта
 	$(".calc").click(function(){
        var fieldValue;  // значение поля
 		for (var i = 0; i < inputs.length; ++i){
            if (!(inputs[i][0])) continue; // TEMP
            fieldValue = '.' + inputs[i][0];
 			if ($(fieldValue).val() == ''){
 				$(fieldValue).val(calculate(inputs[i][2], inputs[i][3], inputs[i][4]));
 			}
 		}
	});

    //// клик по кнопке сброса
    //$('.reset').click(function(){
    //   $('#graph').attr('style', '{visibility:hidden;}')
    //});
    //
    //$(".plot").click(function() {
    //    $('#graph').attr('style', '{visibility:visible;}');
    //});
 });